# 4. Написать программу преобразования десятичного числа в двоичное

# print(' ') 
# print("введите десятичное число для преобразование в двоичное")
# num = int(input())
# index = ''

# while num > 0:
#     index = str(num % 2) + index
#     num = num // 2
 
# print(index)
